Revit 2024 API
DisplacementElement.IsAllowedAsDisplacedElement Method
 Indicates if the specified element is allowed to be displaced.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public static bool IsAllowedAsDisplacedElement(
	Element element
)
Visual Basic
Public Shared Function IsAllowedAsDisplacedElement ( _
	element As Element _
) As Boolean
Visual C++
public:
static bool IsAllowedAsDisplacedElement(
	Element^ element
)
Parameters
element
Type: Autodesk.Revit.DB.Element
 Any element.
Return Value
 Returns true if the element is eligible to be assigned to a DisplacementElement.
Remarks
 Exclusions include view specific elements as well as certain categories of elements.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
DisplacementElement Class
Autodesk.Revit.DB Namespace